Revit 2027 API
View.GetDepthCueing Method
 Returns the current depth cueing settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplayDepthCueing GetDepthCueing()
Public Function GetDepthCueing As ViewDisplayDepthCueing
public:
ViewDisplayDepthCueing^ GetDepthCueing()
member GetDepthCueing : unit -> ViewDisplayDepthCueing
Return Value
ViewDisplayDepthCueing
 Current depth cueing settings.
Exceptions
Exception | Condition
InvalidOperationException |  This view cannot use Depth Cueing
See Also
Reference
View Class
Autodesk.Revit.DB Namespace